Test_Cases/DuctFlow_AR1_Reb3500/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pressureGradiantSource
{
    type            vectorSemiImplicitSource;
    volumeMode      specific;
    selectionMode   all;
    injectionRateSuSp
    {
        U           ((0.00388825 0 0) 0);
    }
}


// ************************************************************************* //
