Test_Cases/DuctFlow_AR1_Reb3500/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-10;
        relTol          0.05;
    }

    "(U|k|epsilon|omega|nuTilda|phit)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0.05;
    }
}

SIMPLE
{

    residualControl
    {
        "(U|p|k|epsilon)" 1e-05;
    }
    nNonOrthogonalCorrectors 0;
	pRefCell	0;
	pRefValue		0;
    consistent          yes;
}

relaxationFactors
{
    equations
    {
        U               0.8;
        "(k|epsilon|omega|nuTilda|phit|f)" 0.4;
		p				0.4;
    }
}

// ************************************************************************* //
